# Eat Safe, Love

## Notebook Set Up

In [1]:
from pymongo import MongoClient
import pandas as pd
from pprint import pprint

In [2]:
# Create an instance of MongoClient
mongo = MongoClient(port=27017)

In [3]:
# assign the uk_food database to a variable name
db = mongo['uk_food']

In [4]:
# review the collections in our database
print(db.list_collection_names())

['establishments']

In [5]:
# assign the collection to a variable
establishments = db['establishments']

## Part 3: Exploratory Analysis
Unless otherwise stated, for each question: 
* Use `count_documents` to display the number of documents contained in the result.
* Display the first document in the results using `pprint`.
* Convert the result to a Pandas DataFrame, print the number of rows in the DataFrame, and display the first 10 rows.

### 1. Which establishments have a hygiene score equal to 20?

In [25]:
# Find the establishments with a hygiene score of 20
query = {'scores.Hygiene': 20}

# Use count_documents to display the number of documents in the result
count = establishments.count_documents(query)
print(f"The number of restaurants with hygiene score of 20 is", count)

The number of restaurants with hygiene score of 20 is 41

In [26]:
# Display the first document in the results using pprint
results = establishments.find(query)

pprint(results[0])

{'AddressLine1': '5-6 Southfields Road',
 'AddressLine2': 'Eastbourne',
 'AddressLine3': 'East Sussex',
 'AddressLine4': '',
 'BusinessName': 'The Chase Rest Home',
 'BusinessType': 'Caring Premises',
 'BusinessTypeID': 5,
 'ChangesByServerID': 0,
 'Distance': 4613.888288172291,
 'FHRSID': 110681,
 'LocalAuthorityBusinessID': '4029',
 'LocalAuthorityCode': '102',
 'LocalAuthorityEmailAddress': 'Customerfirst@eastbourne.gov.uk',
 'LocalAuthorityName': 'Eastbourne',
 'LocalAuthorityWebSite': 'http://www.eastbourne.gov.uk/foodratings',
 'NewRatingPending': False,
 'Phone': '',
 'PostCode': 'BN21 1BU',
 'RatingDate': '2021-09-23T00:00:00',
 'RatingKey': 'fhrs_0_en-gb',
 'RatingValue': 0,
 'RightToReply': '',
 'SchemeType': 'FHRS',
 '_id': ObjectId('6648301d181e2e12ac4d2e5d'),
 'geocode': {'latitude': 50.769705, 'longitude': 0.27694},
 'links': [{'href': 'https://api.ratings.food.gov.uk/establishments/110681',
            'rel': 'self'}],
 'meta': {'dataSource': None,
          'extractDate': '0001-01-01T00:00:00',
          'itemCount': 0,
          'pageNumber': 0,
          'pageSize': 0,
          'returncode': None,
          'totalCount': 0,
          'totalPages': 0},
 'scores': {'ConfidenceInManagement': 20, 'Hygiene': 20, 'Structural': 20}}

In [32]:
# Write a match_query to find the establishments with a hygiene score of 20 
match_query =  {
    '$match':
    {
        'scores.Hygiene': {'$eq': 20}
    }
}

# Write an aggregation query that counts the number of documents, grouped by "BusinessName"
group_query = {
    '$group': {
        '_id': "$BusinessName",
        'count': { '$sum': 1 }
    }
}

# Create a dictionary that will allow the pipeline to sort by count in descending order
sort_values = {
    '$sort': {
        'count': -1
    }
}

# Put the pipeline together
pipeline = [match_query, group_query, sort_values]

pipeline

[{'$match': {'scores.Hygiene': {'$eq': 20}}},
 {'$group': {'_id': '$BusinessName', 'count': {'$sum': 1}}},
 {'$sort': {'count': -1}}]

In [33]:
# Run the pipeline through the aggregate method and save the results to a variable
results = list(establishments.aggregate(pipeline))

In [34]:
# Print the number of countries in the result
print("Number of establishments in result: ", len(results))

Number of establishments in result:  40

In [35]:
# Print the first 10 results
pprint(results[0:10])

[{'_id': 'Golden Palace', 'count': 2},
 {'_id': 'Sisko Cafe', 'count': 1},
 {'_id': 'Pakhtoonkhwa Restaurant', 'count': 1},
 {'_id': 'La Simon Ltd', 'count': 1},
 {'_id': 'Kennedy Fried Chicken', 'count': 1},
 {'_id': "Ashby's Butchers", 'count': 1},
 {'_id': 'Seaford Pizza', 'count': 1},
 {'_id': 'Costcutter', 'count': 1},
 {'_id': 'Westview Playgroup Based At Downsview Comm Primary', 'count': 1},
 {'_id': 'Gah Shing', 'count': 1}]

In [36]:
# Convert the result to a Pandas DataFrame
result_df = pd.DataFrame(results)
# Display the number of rows in the DataFrame
print("Rows in DataFrame: ", len(result_df))

# Display the first 10 rows of the DataFrame
result_df.head(10)

Rows in DataFrame:  40

                                                 _id  count
0                                      Golden Palace      2
1                                         Sisko Cafe      1
2                            Pakhtoonkhwa Restaurant      1
3                                       La Simon Ltd      1
4                              Kennedy Fried Chicken      1
5                                   Ashby's Butchers      1
6                                      Seaford Pizza      1
7                                         Costcutter      1
8  Westview Playgroup Based At Downsview Comm Pri...      1
9                                          Gah Shing      1

### 2. Which establishments in London have a `RatingValue` greater than or equal to 4?

In [40]:
# Write a match_query to find the establishments with London as the Local Authority and has a RatingValue greater than or equal to 4.
match_query =  {'$match': {'LocalAuthorityName': {'$regex': 'London'},
               'RatingValue': {'$gte': 4}}}

# Write an aggregation query that counts the number of documents, grouped by "BusinessName"
group_query = {
    '$group': {
        '_id': "$BusinessName",
        'count': { '$sum': 1 }
    }
}

# Create a dictionary that will allow the pipeline to sort by count in descending order
sort_values = {
    '$sort': {
        'count': -1
    }
}

# Put the pipeline together
pipeline = [match_query, group_query, sort_values]

pipeline

[{'$match': {'LocalAuthorityName': {'$regex': 'London'},
   'RatingValue': {'$gte': 4}}},
 {'$group': {'_id': '$BusinessName', 'count': {'$sum': 1}}},
 {'$sort': {'count': -1}}]

In [41]:
# Run the pipeline through the aggregate method, cast the results as a list, and save the results to a variable
results = list(establishments.aggregate(pipeline))

In [42]:
# Print the number of rows in the result
print("Number of rows in result: ", len(results))

Number of rows in result:  33

In [43]:
# Print the first 10 results
pprint(results[0])

{'_id': 'MV Monsoon clipper', 'count': 1}

In [44]:
# Convert the result to a Pandas DataFrame
result_df = pd.DataFrame(results)
# Display the number of rows in the DataFrame
print("Rows in DataFrame: ", len(result_df))

# Display the first 10 rows of the DataFrame
result_df.head(10)

Rows in DataFrame:  33

                                    _id  count
0                    MV Monsoon clipper      1
1                             Charlie's      1
2  Coombs Catering t/a The Lock and Key      1
3               Mv City Cruises Erasmus      1
4                       Canary Wharf 1V      1
5                        MV Sun clipper      1
6                    MV Neptune clipper      1
7                         La Nonna lina      1
8                         Tereza Joanne      1
9         The Nuance Group (UK) Limited      1

### 3. What are the top 5 establishments with a `RatingValue` rating value of 5, sorted by lowest hygiene score, nearest to the new restaurant added, "Penang Flavours"?

In [49]:
query = {'BusinessName': 'Penang Flavours'}
results = establishments.find(query)

pprint(results[0])

{'AddressLine1': 'Penang Flavours',
 'AddressLine2': '146A Plumstead Rd',
 'AddressLine3': 'London',
 'AddressLine4': '',
 'BusinessName': 'Penang Flavours',
 'BusinessType': 'Restaurant/Cafe/Canteen',
 'BusinessTypeID': 1,
 'Distance': 4623.972328074718,
 'LocalAuthorityCode': '511',
 'LocalAuthorityEmailAddress': 'health@royalgreenwich.gov.uk',
 'LocalAuthorityName': 'Greenwich',
 'LocalAuthorityWebSite': 'http://www.royalgreenwich.gov.uk',
 'NewRatingPending': True,
 'Phone': '',
 'PostCode': 'SE18 7DY',
 'RatingValue': None,
 'RightToReply': '',
 'SchemeType': 'FHRS',
 '_id': ObjectId('664830c45ff652b9521bcf7e'),
 'geocode': {'latitude': 51.490142, 'longitude': 0.08384},
 'scores': {'ConfidenceInManagement': '', 'Hygiene': '', 'Structural': ''}}

In [55]:
# Search within 0.01 degree on either side of the latitude and longitude.
# Rating value must equal 5
# Sort by hygiene score

degree_search = 0.01
latitude =  51.490142
longitude = 0.08384

query = {
    'geocode.latitude': {'$gte': latitude - degree_search, '$lte': latitude + degree_search},
    'geocode.longitude': {'$gte': longitude - degree_search, '$lte': longitude + degree_search},
    'RatingValue': 5
}

fields = {
    "BusinessName": 1,
    "RatingValue": 1,
    "scores.Hygiene": 1,
}

sort_values = {
    '$sort': {
        'RatingValue': -1,
        'scores.Hygiene': 1
    }
}
limit = 5

# Cast the results as a list and save the results to a variable
results = list(establishments.find(query, fields).sort(sort).limit(limit))

# Pprint the results
pprint(results)

[{'BusinessName': 'Volunteer',
  'RatingValue': 5,
  '_id': ObjectId('6648301e181e2e12ac4d86bb'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Plumstead Manor Nursery',
  'RatingValue': 5,
  '_id': ObjectId('6648301e181e2e12ac4d86d3'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Iceland',
  'RatingValue': 5,
  '_id': ObjectId('6648301e181e2e12ac4d8691'),
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'TIWA N TIWA African Restaurant Ltd',
  'RatingValue': 5,
  '_id': ObjectId('6648301e181e2e12ac4d8667'),
  'scores': {'Hygiene': 5}},
 {'BusinessName': 'Howe and Co Fish and Chips - Van 17',
  'RatingValue': 5,
  '_id': ObjectId('6648301e181e2e12ac4d869d'),
  'scores': {'Hygiene': 0}}]

In [57]:
# Convert result to Pandas DataFrame
results_df = pd.DataFrame(results)
results_df

,_id,BusinessName,RatingValue,scores
0,6648301e181e2e12ac4d86bb,Volunteer,5,{'Hygiene': 0}
1,6648301e181e2e12ac4d86d3,Plumstead Manor Nursery,5,{'Hygiene': 0}
2,6648301e181e2e12ac4d8691,Iceland,5,{'Hygiene': 0}
3,6648301e181e2e12ac4d8667,TIWA N TIWA African Restaurant Ltd,5,{'Hygiene': 5}
4,6648301e181e2e12ac4d869d,Howe and Co Fish and Chips - Van 17,5,{'Hygiene': 0}

### 4. How many establishments in each Local Authority area have a hygiene score of 0?

In [47]:
# Create a pipeline that:
# 1. Matches establishments with a hygiene score of 0
match_query =  {'$match': {'scores.Hygiene': {'$eq': 0}}}

# 2. Groups the matches by Local Authority
group_query = {'$group': {'_id': "$LocalAuthorityName", 'count': { '$sum': 1 }}}

# 3. Sorts the matches from highest to lowest
sort_values = {'$sort': {'count': -1}}

# Put the pipeline together
pipeline = [match_query, group_query, sort_values]

# Run the pipeline through the aggregate method, cast the results as a list, and save the results to a variable
results = list(establishments.aggregate(pipeline))

# Print the number of documents in the result
print("Number of rows in result: ", len(results))

# Print the first 10 results

pprint(results[0:10])

Number of rows in result:  55
[{'_id': 'Thanet', 'count': 1130},
 {'_id': 'Greenwich', 'count': 882},
 {'_id': 'Maidstone', 'count': 713},
 {'_id': 'Newham', 'count': 711},
 {'_id': 'Swale', 'count': 686},
 {'_id': 'Chelmsford', 'count': 680},
 {'_id': 'Medway', 'count': 672},
 {'_id': 'Bexley', 'count': 607},
 {'_id': 'Southend-On-Sea', 'count': 586},
 {'_id': 'Tendring', 'count': 542}]

In [48]:
# Convert the result to a Pandas DataFrame
result_df = pd.DataFrame(results)

# Display the number of rows in the DataFrame
print("Rows in DataFrame: ", len(result_df))

# Display the first 10 rows of the DataFrame
result_df.head(10)

Rows in DataFrame:  55

               _id  count
0           Thanet   1130
1        Greenwich    882
2        Maidstone    713
3           Newham    711
4            Swale    686
5       Chelmsford    680
6           Medway    672
7           Bexley    607
8  Southend-On-Sea    586
9         Tendring    542